# InvalidAreaLoadSketchError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LoadFailures..::..InvalidAreaLoadSketchError Property
BuiltInFailures..::..LoadFailures Class See Also
---
Area Load has invalid Sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidAreaLoadSketchError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidAreaLoadSketchError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidAreaLoadSketchError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LoadFailures Class
Autodesk.Revit.DB Namespace